id=input('請輸入身分證字號:')
a={'A':'台北市','B':'台中市','C':'基隆市','D':'台南市','E':'高雄市','F':'台北縣','G':'宜蘭縣','H':'宜蘭縣',
'I':'嘉義市','J':'新竹縣','K':'苗栗縣','L':'台中縣','M':'南投縣','N':'彰化縣','O':'新竹市','P':'雲林縣','Q':'嘉義縣',
'R':'台南縣','S':'高雄縣','T':'屏東縣','U':'花蓮縣','V':'台東縣','W':'金門縣','X':'澎湖縣','Y':'陽明山','Z':'連江縣'}

while True:
    if len(id)==10:
        if int(id[1:2])==1:
            print('你是男生')
            break
        elif int(id[1:2])==2:
            print('妳是女生')
            break
        else:
            id=input('錯誤,請重新輸入:')
    else:
        id=input('錯誤,請重新輸入:')

print('出生於'+a[id[0:1]])